In [1]:
import pandas as pd

Q1. List any five functions of the pandas library with execution.

1. pd.DataFrame() : used to create a new dataframe

In [2]:
data = [[3,4,5,6,7],[3,0,9,8,7],[4,3,5,6,7]]
df = pd.DataFrame(data)
df

   0  1  2  3  4
0  3  4  5  6  7
1  3  0  9  8  7
2  4  3  5  6  7

2. mean() : used to get mean all numeric values column

In [3]:
df.mean()

0    3.333333
1    2.333333
2    6.333333
3    6.666667
4    7.000000
dtype: float64

3. pd.Series( ) create a pandas series

In [4]:
df1 = pd.Series([4,5,6,7,8,9])
type(df1)

pandas.core.series.Series

In [5]:
print(df1)

0    4
1    5
2    6
3    7
4    8
5    9
dtype: int64

4. pd.read_csv() used to read a csv file in pandas

In [6]:
df2 = pd.read_csv('player_data.csv')

5.df.sum() used to sum all numeric data columns

In [7]:
df1.sum()

39

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [8]:
data = [['lea','hea','few'],['foo','zoo','moo'],['bean','team','lore']]
df = pd.DataFrame(data, columns = ['A','B','C'])
df

      A     B     C
0   lea   hea   few
1   foo   zoo   moo
2  bean  team  lore

In [11]:
df.reindex([1,3])

     A    B    C
1  foo  zoo  moo
3  NaN  NaN  NaN

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [14]:
df1 = {'Values' : [10, 20, 30, 40, 50]}
df2 = pd.DataFrame(df1)
df2

   Values
0      10
1      20
2      30
3      40
4      50

In [20]:
def three_sum(df):
    first_three = df[0:3]
    return first_three.sum() 
three_sum(df2)

Values    60
dtype: int64

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [21]:
data = {'Text':['Akash','PQ','Jennet']}
df = pd.DataFrame(data)
df

     Text
0   Akash
1      PQ
2  Jennet

In [22]:
df['Word_Count'] = df['Text'].str.len()

In [23]:
df

     Text  Word_Count
0   Akash           5
1      PQ           2
2  Jennet           6

Q5. How are DataFrame.size() and DataFrame.shape() different?

Ans> DataFrame.size it returns number_row*number_column

In [24]:
df = pd.DataFrame({'name':['ye','fee','gol','jho'],
                   'Age':[3,4,5,7]})
df.size

8

DataFrame.shape it is return number_row,number_column

In [25]:
df = pd.DataFrame({'name':['ye','fee','gol','jho'],
                   'Age':[3,4,5,7]})
df.shape

(4, 2)

In [26]:
df

  name  Age
0   ye    3
1  fee    4
2  gol    5
3  jho    7

Q6. Which function of pandas do we use to read an excel file?

In [ ]:
pd.read_excel("excel_file_path")

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

In [46]:
df = pd.DataFrame({'Email':['john.doe@example.com','nazer@gmail.com']})
df

                  Email
0  john.doe@example.com
1       nazer@gmail.com

In [50]:
def username_of_dataframe(df):
    df[['Username','Company']] = df['Email'].str.split("@",expand = True)
    df.drop(df.columns[2], axis=1, inplace=True)
    return df 
username_of_dataframe(df)

                  Email  Username
0  john.doe@example.com  john.doe
1       nazer@gmail.com     nazer

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

For example, if df contains the following values:

  A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2



Your function should select the following rows: 
  A B C
1 8 2 7
4 9 1 2
The function should return a new DataFrame that contains only the selected rows.

In [52]:
data = [[ 3, 5, 1],[8, 2, 7],[6, 9, 4],[2, 3, 5],[9, 1, 2]]
df = pd.DataFrame(data, columns = ['A','B','C'])
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [54]:
def row_A_B_df(df):
    new_df = df[(df['A'] > 5)  & (df['B'] < 10 )]
    return new_df
row_A_B_df(df)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [55]:
df = pd.DataFrame({'Values': [2,3,4,5,6,7,8]})
df

   Values
0       2
1       3
2       4
3       5
4       6
5       7
6       8

In [58]:
def descibe(df):
    desc = df.describe()
    mean = df.mean()
    median = df.median()
    standard_deviation = df.std()
    return desc,mean,median,standard_deviation
descibe(df)

(         Values
 count  7.000000
 mean   5.000000
 std    2.160247
 min    2.000000
 25%    3.500000
 50%    5.000000
 75%    6.500000
 max    8.000000,
 Values    5.0
 dtype: float64,
 Values    5.0
 dtype: float64,
 Values    2.160247
 dtype: float64)

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [60]:
import numpy as np
df = pd.DataFrame(pd.date_range(start='2023-02-10' , end = '2023-02-26'), columns = ['Date'])
df['Sales'] = np.random.randint(100,1000,size=(17))
df[['Sales','Date']]

    Sales       Date
0     737 2023-02-10
1     397 2023-02-11
2     202 2023-02-12
3     709 2023-02-13
4     902 2023-02-14
5     634 2023-02-15
6     189 2023-02-16
7     302 2023-02-17
8     397 2023-02-18
9     240 2023-02-19
10    618 2023-02-20
11    506 2023-02-21
12    800 2023-02-22
13    712 2023-02-23
14    745 2023-02-24
15    613 2023-02-25
16    714 2023-02-26

In [61]:
def Movingaverage(df):
    df['Moving Average'] = df['Sales'].rolling(window=7).mean().round(2)
    return df
Movingaverage(df)

         Date  Sales  Moving Average
0  2023-02-10    737             NaN
1  2023-02-11    397             NaN
2  2023-02-12    202             NaN
3  2023-02-13    709             NaN
4  2023-02-14    902             NaN
5  2023-02-15    634             NaN
6  2023-02-16    189          538.57
7  2023-02-17    302          476.43
8  2023-02-18    397          476.43
9  2023-02-19    240          481.86
10 2023-02-20    618          468.86
11 2023-02-21    506          412.29
12 2023-02-22    800          436.00
13 2023-02-23    712          510.71
14 2023-02-24    745          574.00
15 2023-02-25    613          604.86
16 2023-02-26    714          672.57

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.

For example, if df contains the following values:
Date
O 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

Your function should create the following DataFrame:
Date Weekday
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday

The function should return the modified DataFrame.

In [62]:
date = pd.date_range(start='2023-01-01' , end = '2023-01-05')
df = pd.DataFrame({'Date':date})
df

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [63]:
def Weekday(df):
    df['Weekday'] = df['Date'].dt.day_name()
    return df
Weekday(df)

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [66]:
data1 = pd.date_range(start = '2022-12-01' , end = '2023-02-28')
df_date = pd.DataFrame(data1, columns = ['Date'])
df_date

         Date
0  2022-12-01
1  2022-12-02
2  2022-12-03
3  2022-12-04
4  2022-12-05
..        ...
85 2023-02-24
86 2023-02-25
87 2023-02-26
88 2023-02-27
89 2023-02-28

[90 rows x 1 columns]

In [68]:
start = '2023-01-01'
end =  '2023-01-31'
mask = (df_date['Date'] > start) & (df_date['Date'] < end)
df_date.loc[mask]

         Date
32 2023-01-02
33 2023-01-03
34 2023-01-04
35 2023-01-05
36 2023-01-06
37 2023-01-07
38 2023-01-08
39 2023-01-09
40 2023-01-10
41 2023-01-11
42 2023-01-12
43 2023-01-13
44 2023-01-14
45 2023-01-15
46 2023-01-16
47 2023-01-17
48 2023-01-18
49 2023-01-19
50 2023-01-20
51 2023-01-21
52 2023-01-22
53 2023-01-23
54 2023-01-24
55 2023-01-25
56 2023-01-26
57 2023-01-27
58 2023-01-28
59 2023-01-29
60 2023-01-30

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?